## 6.3 	函数应用

In [2]:
import pandas as pd
import numpy as np

### 6.3.1 	函数应用apply方法

In [10]:
def func1(x): # x单个值（标量）
   return x*100

In [11]:
s = pd.Series([8, 7, 3], index=list('abc'))
s

a    8
b    7
c    3
dtype: int64

In [12]:
s.apply(func1)

a    800
b    700
c    300
dtype: int64

In [13]:
data = {'apples': [2, 2, 1],
         'oranges': [1, 1, 3],
         'bananas': [1, 2, 1] }
df = pd.DataFrame(data, index=['June','Robert','Lily'])
df

        apples  oranges  bananas
June         2        1        1
Robert       2        1        2
Lily         1        3        1

In [14]:
df.apply(func1)

        apples  oranges  bananas
June       200      100      100
Robert     200      100      200
Lily       100      300      100

In [15]:
s.apply(lambda x:x*100)

a    800
b    700
c    300
dtype: int64

In [16]:
df.apply(lambda x:x*100)

        apples  oranges  bananas
June       200      100      100
Robert     200      100      200
Lily       100      300      100

In [17]:
df.apply(lambda x:x.max() - x.min())

apples     1
oranges    2
bananas    1
dtype: int64

In [19]:
df.apply(lambda x:x.max() - x.min(), axis=0)

apples     1
oranges    2
bananas    1
dtype: int64

In [20]:
df.apply(lambda x:x.max() - x.min(), axis=1)

June      1
Robert    1
Lily      2
dtype: int64

### 6.3.2 	函数应用applymap方法

In [21]:
df.applymap(lambda x:x*100)

        apples  oranges  bananas
June       200      100      100
Robert     200      100      200
Lily       100      300      100

In [22]:
s.map(lambda x:x*100)

a    800
b    700
c    300
dtype: int64